# Pandas Serisi Oluşturmak

ℹ️ *Pandas kütüphanesine özel bir veri yapısıdır.NumPy array'lerine benzer.Ek olarak index bilgisi de tutar.Yani ayrı bir bileşen olarak pandas serisi içerisinde tutulur(Internal).*<br>

In [3]:
import pandas as pd

In [5]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
seri = pd.Series([10,20,30,40,50])
print(seri)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [7]:
type(seri)

pandas.core.series.Series

In [9]:
# Index bilgilerine ulaşmak için
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [11]:
seri.dtype

dtype('int64')

In [12]:
seri.size

5

In [13]:
seri.ndim

1

In [14]:
seri.values

array([10, 20, 30, 40, 50])

In [16]:
seri.head()

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [17]:
seri.tail(3)

2    30
3    40
4    50
dtype: int64

In [20]:
# Index İsimlendirmesi

In [21]:
pd.Series([553,156,77,23,11])

0    553
1    156
2     77
3     23
4     11
dtype: int64

In [22]:
pd.Series([553,156,77,23,11], index = [1,3,5,7,9])

1    553
3    156
5     77
7     23
9     11
dtype: int64

In [24]:
seri = pd.Series([553,156,77,23,11], index = ["a","b","c","d","e"])

In [25]:
seri["a"]

np.int64(553)

In [26]:
seri["a":"c"]

a    553
b    156
c     77
dtype: int64

## Sözlük Üzerinden Liste oluşturmak

In [30]:
sozluk = {"reg" : 10, "log" : 11, "cart" : 12}

In [31]:
seri = pd.Series(sozluk)

In [32]:
seri

reg     10
log     11
cart    12
dtype: int64

In [33]:
# iki seri birleştirerek seri oluşturma

In [35]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

# Eleman İşlemleri

In [39]:
import numpy as np
a = np.array([15,46,777,88,95])
seri = pd.Series(a)
seri

0     15
1     46
2    777
3     88
4     95
dtype: int64

In [40]:
seri[0]

np.int64(15)

In [41]:
seri[0:3]

0     15
1     46
2    777
dtype: int64

In [52]:
seri = pd.Series([11,55,34,89], index = ["reg", "loj", "cart", "rf"])

In [53]:
seri

reg     11
loj     55
cart    34
rf      89
dtype: int64

In [54]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [55]:
seri.keys

<bound method Series.keys of reg     11
loj     55
cart    34
rf      89
dtype: int64>

In [56]:
list(seri.items())

[('reg', 11), ('loj', 55), ('cart', 34), ('rf', 89)]

In [57]:
seri.values

array([11, 55, 34, 89])

In [58]:
# eleman sorgulama

In [59]:
"reg" in seri

True

In [60]:
"a" in seri

False

In [61]:
seri["reg"]

np.int64(11)

In [62]:
# fancy eleman

In [63]:
seri[["reg", "rf"]]

reg    11
rf     89
dtype: int64

In [64]:
seri["reg"] = 44

In [65]:
seri

reg     44
loj     55
cart    34
rf      89
dtype: int64

In [66]:
seri["reg" : "loj"]

reg    44
loj    55
dtype: int64

In [67]:
# Pandas Dataframe Oluşturma

In [68]:
import pandas as pd

In [69]:
l = [1,16,77,89,101]

In [71]:
pd.DataFrame(l, columns = ["Degisken_ismi"])

   Degisken_ismi
0              1
1             16
2             77
3             89
4            101

In [75]:
import numpy as np
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [77]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [78]:
# df isimlendirme

In [80]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [81]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [82]:
df.columns = ("deg1", "deg2", "deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [83]:
type(df)

pandas.core.frame.DataFrame

In [84]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [85]:
df.shape

(3, 3)

In [86]:
df.ndim

2

In [87]:
df.size

9

In [88]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [89]:
type(df.values)

numpy.ndarray

In [90]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [92]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [94]:
a = np.array([1,3,5,7,9])

In [97]:
pd.DataFrame(a, columns = ["deg1"])

   deg1
0     1
1     3
2     5
3     7
4     9

In [9]:
# sozluk üzerinden dataframe oluşturma

In [10]:
from numpy import random
s1 = random.randint(10, size = 5)
s2 = random.randint(10, size = 5)
s3 = random.randint(10, size = 5)

In [11]:
sozluk = {"var1" : s1, "var2" : s2, "var3" : s3}

In [12]:
sozluk

{'var1': array([4, 4, 8, 1, 9], dtype=int32),
 'var2': array([6, 9, 8, 5, 3], dtype=int32),
 'var3': array([0, 5, 1, 6, 9], dtype=int32)}

In [21]:
import pandas as pd
df = pd.DataFrame(sozluk)

In [22]:
df

   var1  var2  var3
0     4     6     0
1     4     9     5
2     8     8     1
3     1     5     6
4     9     3     9

In [23]:
df[0:1]

   var1  var2  var3
0     4     6     0

In [24]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [25]:
df.index = ["a", "b", "c", "d", "e"]

In [26]:
df

   var1  var2  var3
a     4     6     0
b     4     9     5
c     8     8     1
d     1     5     6
e     9     3     9

In [27]:
df["c":"e"]

   var1  var2  var3
c     8     8     1
d     1     5     6
e     9     3     9

In [28]:
#silme

In [29]:
df.drop("a", axis = 0)

   var1  var2  var3
b     4     9     5
c     8     8     1
d     1     5     6
e     9     3     9

In [30]:
#kalıcı olarak silmek için

In [31]:
df.drop("a", axis = 0, inplace = True)

In [32]:
df

   var1  var2  var3
b     4     9     5
c     8     8     1
d     1     5     6
e     9     3     9

In [34]:
#fancy index ile silme işlemi

In [35]:
l = ["b", "c"]

In [38]:
df.drop(l, axis = 0)

   var1  var2  var3
d     1     5     6
e     9     3     9

In [39]:
#değişkenler için

In [40]:
df

   var1  var2  var3
b     4     9     5
c     8     8     1
d     1     5     6
e     9     3     9

In [41]:
"var1" in df

True

In [42]:
l = ["var1", "var4","var3"]

In [43]:
for i in l:
    print(i in df)

True
False
True

In [44]:
df["var4"] = df["var1"] / df["var2"]

In [45]:
df

   var1  var2  var3      var4
b     4     9     5  0.444444
c     8     8     1  1.000000
d     1     5     6  0.200000
e     9     3     9  3.000000

In [46]:
#değişken silmek

In [49]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     4     9     5
c     8     8     1
d     1     5     6
e     9     3     9

In [50]:
df

   var1  var2  var3      var4
b     4     9     5  0.444444
c     8     8     1  1.000000
d     1     5     6  0.200000
e     9     3     9  3.000000

In [51]:
df.drop("var4", axis = 1, inplace = True)

In [52]:
df

   var1  var2  var3
b     4     9     5
c     8     8     1
d     1     5     6
e     9     3     9

In [56]:
#fancy index ile

In [54]:
l = ["var1", "var2"]

In [55]:
df.drop(l, axis = 1)

   var3
b     5
c     1
d     6
e     9

# Gözlem ve Değişken Seçimi (loc & iloc)

In [58]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2", "var3"])
df

   var1  var2  var3
0    16    10    11
1    17    10     1
2    20     3    28
3     2    21    29
4    21    23    18
5     4     5    22
6    29     9    13
7     7     3    18
8     2    23     2
9     3     4    12

In [65]:
#loc : Alışık olduğumuz indeksleme mantığından farklı bir şekilde çalışır.Yani inclusive - exclusive mantığı burda yoktur.
#Kısaca nasıl tanımlandı ise o şekilde seçim yapma olanağına sahiptir.

In [61]:
df.loc[0:3]

   var1  var2  var3
0    16    10    11
1    17    10     1
2    20     3    28
3     2    21    29

In [71]:
#iloc: İndeksleme mantığı ile çalışır.

In [72]:
df.iloc[0:3]

   var1  var2  var3
0    16    10    11
1    17    10     1
2    20     3    28

In [68]:
df.iloc[0,0]

np.int32(16)

In [69]:
df

   var1  var2  var3
0    16    10    11
1    17    10     1
2    20     3    28
3     2    21    29
4    21    23    18
5     4     5    22
6    29     9    13
7     7     3    18
8     2    23     2
9     3     4    12

In [70]:
df.iloc[:3,:2]

   var1  var2
0    16    10
1    17    10
2    20     3

In [74]:
df.loc[0:3, "var3"]

0    11
1     1
2    28
3    29
Name: var3, dtype: int32

In [78]:
df.iloc[0:3]["var3"]

0    11
1     1
2    28
Name: var3, dtype: int32

# Koşullu Eleman İşlemleri

In [87]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2", "var3"])
df

   var1  var2  var3
0    26     4    23
1    23     6    24
2    17    12     6
3    26     1    22
4     3    10    14
5     1    12    12
6    25     6    21
7    18     4    28
8    12     3     1
9    17    18     7

In [80]:
df["var1"]

0    23
1     3
2    12
3    28
4     7
5     7
6     6
7    11
8    15
9    25
Name: var1, dtype: int32

In [81]:
df["var1"][0:2]

0    23
1     3
Name: var1, dtype: int32

In [82]:
df.var1

0    23
1     3
2    12
3    28
4     7
5     7
6     6
7    11
8    15
9    25
Name: var1, dtype: int32

In [86]:
df[df.var1 > 15]["var1"]

0    23
3    28
9    25
Name: var1, dtype: int32

In [91]:
df[(df.var1 > 15) & (df.var3 < 7)]

   var1  var2  var3
2    17    12     6

In [93]:
df.loc[(df.var1 > 15), ["var2","var3"]]

   var2  var3
0     4    23
1     6    24
2    12     6
3     1    22
6     6    21
7     4    28
9    18     7

In [95]:
#alternatif
df[(df.var1 > 15)][["var2","var3"]]

   var2  var3
0     4    23
1     6    24
2    12     6
3     1    22
6     6    21
7     4    28
9    18     7

# Birleştirme(Join) İşlemleri

In [98]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2", "var3"])
df1

   var1  var2  var3
0    24     8    11
1    22    23    19
2     2     9    27
3     3     4    29
4    23    25    19

In [99]:
df2 = df1 + 99

In [100]:
df2

   var1  var2  var3
0   123   107   110
1   121   122   118
2   101   108   126
3   102   103   128
4   122   124   118

In [105]:
pd.concat([df1,df2])

   var1  var2  var3
0    24     8    11
1    22    23    19
2     2     9    27
3     3     4    29
4    23    25    19
0   123   107   110
1   121   122   118
2   101   108   126
3   102   103   128
4   122   124   118

In [ ]:
?pd.concat

In [108]:
pd.concat([df1,df2], ignore_index = True)

   var1  var2  var3
0    24     8    11
1    22    23    19
2     2     9    27
3     3     4    29
4    23    25    19
5   123   107   110
6   121   122   118
7   101   108   126
8   102   103   128
9   122   124   118

In [110]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [111]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [112]:
df2.columns = ["var1", "var2", "deg3"]

In [113]:
df2

   var1  var2  deg3
0   123   107   110
1   121   122   118
2   101   108   126
3   102   103   128
4   122   124   118

In [114]:
df1

   var1  var2  var3
0    24     8    11
1    22    23    19
2     2     9    27
3     3     4    29
4    23    25    19

In [116]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0    24     8  11.0    NaN
1    22    23  19.0    NaN
2     2     9  27.0    NaN
3     3     4  29.0    NaN
4    23    25  19.0    NaN
0   123   107   NaN  110.0
1   121   122   NaN  118.0
2   101   108   NaN  126.0
3   102   103   NaN  128.0
4   122   124   NaN  118.0

In [121]:
#inner join:Bildiğimiz kümelerde kesişim işlemi ile aynı mantıkta çalışır.Ortak olan sütunları birleştirir.
pd.concat([df1,df2], join = "inner",ignore_index = True)

   var1  var2
0    24     8
1    22    23
2     2     9
3     3     4
4    23    25
5   123   107
6   121   122
7   101   108
8   102   103
9   122   124

In [124]:
pd.concat([df1,df2], join_axes = [df1.columns])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [129]:
# pandas'ın yeni sürümünde concat metodu artık 'join_axes' argümanını barındırmadığı için bu işlem hatalı sonlandı.

# İleri Birleştirme İşlemleri

In [130]:
#birebir birleştirme

In [131]:
import pandas as pd

In [136]:
df1 = pd.DataFrame({'calisanlar' : ['Ali', 'Veli', 'Ayse', 'Fatma'],
                   'grup' : ['Muhasebe', 'Mühendislik', 'Mühendislik', 'İK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayse  Mühendislik
3      Fatma           İK

In [137]:
df2 = pd.DataFrame({'calisanlar' : ['Ayse', 'Ali', 'Veli', 'Fatma'],
                    'ilk_giris' : [2010, 2009, 2014, 2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [138]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayse  Mühendislik       2010
3      Fatma           İK       2019

In [139]:
#alternatif

In [140]:
pd.merge(df1,df2,on = 'calisanlar')

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayse  Mühendislik       2010
3      Fatma           İK       2019

In [141]:
#çoktan teke (many-to-one)

In [142]:
df3 = pd.merge(df1,df2)

In [143]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayse  Mühendislik       2010
3      Fatma           İK       2019

In [145]:
df4 = pd.DataFrame({'grup' : ['Muhasebe', 'Mühendislik', 'İK'],
                    'mudur' : ['Caner', 'Mustafa', 'Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           İK  Berkcan

In [146]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Mühendislik       2014  Mustafa
2       Ayse  Mühendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [154]:
#Çoktan çoka(many-to-many)

In [151]:
df5 = pd.DataFrame({'grup' : ['Muhasebe', 'Muhasebe', 'Mühendislik', 'Mühendislik', 'İK', 'İK'],
                    'yetenekler' : ['matematik', 'excel', 'kodlama', 'linux', 'excel', 'yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Mühendislik    kodlama
3  Mühendislik      linux
4           İK      excel
5           İK    yonetim

In [152]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayse  Mühendislik
3      Fatma           İK

In [153]:
pd.merge(df1, df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Mühendislik    kodlama
3       Veli  Mühendislik      linux
4       Ayse  Mühendislik    kodlama
5       Ayse  Mühendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

# Toplulaştırma ve Gruplama(Aggregation & Grouping)

### Basit Toplulaşırma Fonksiyonları

#### count()
#### first()
#### last()
#### mean()
#### median()
#### min()
#### max()
#### std()
#### var()
#### sum()

In [1]:
import seaborn as sns

In [4]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\users\tcmur\appdata\local\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [2]:
df = sns.load_dataset("planets")

In [5]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [7]:
df.shape

(1035, 6)

In [14]:
df["mass"].mean()

np.float64(2.6381605847953216)

In [15]:
df["mass"].count()

np.int64(513)

In [16]:
df["mass"].min()

0.0036

In [17]:
df["mass"].max()

25.0

In [18]:
df["mass"].sum()

np.float64(1353.37638)

In [19]:
df["mass"].std()

3.8186166509616046

In [20]:
df["mass"].var()

14.58183312700122

In [21]:
#alternative

In [22]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [23]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [25]:
#boş değerleri silersek
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Gruplama İşlemleri(Grouping)

In [42]:
import pandas as pd

In [33]:
df = pd.DataFrame({"Gruplar" : ['A', 'B', 'C', 'A', 'B', 'C'],
                   "Veri" : [10,11,52,23,43,55]}, columns = ["Gruplar", "Veri"])
df

  Gruplar  Veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [37]:
df.groupby("Gruplar")

In [38]:
df.groupby("Gruplar").mean()

         Veri
Gruplar
A        16.5
B        27.0
C        53.5

In [39]:
df.groupby("Gruplar").sum()

         Veri
Gruplar
A          33
B          54
C         107

In [45]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [46]:
df.groupby("method")

In [47]:
df.groupby("method")["orbital_period"]

In [48]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [50]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [51]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## İleri Toplulaştırma İşlemleri(aggregate, filter, transform, apply)

In [2]:
import numpy as np
import pandas as pd

In [61]:
df = pd.DataFrame({'gruplar':  ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [62]:
#aggregate

In [63]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [66]:
df.groupby("gruplar").aggregate(["min", np.median, max])

C:\Users\tcmur\AppData\Local\Temp\ipykernel_8484\1569478810.py:1: FutureWarning: The provided callable <function median at 0x0000021CCBEE3F60> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby("gruplar").aggregate(["min", np.median, max])
C:\Users\tcmur\AppData\Local\Temp\ipykernel_8484\1569478810.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby("gruplar").aggregate(["min", np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [67]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [68]:
#filter

In [69]:
df = pd.DataFrame({'gruplar':  ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [72]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [74]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [73]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [75]:
#transform

In [76]:
df = pd.DataFrame({'gruplar':  ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [82]:
df_a = df.iloc[:,1:3]

In [83]:
df_a.transform(lambda x : x-x.mean())

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [85]:
df_a.transform(lambda x : (x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [87]:
#transform fonksiyonu vektörizasyon yaparak çalışır.Yani Değişken(sutün) bazında çalışır.
#Yukarıdaki lambda fonksiyonunda x olarak gösterilen aslında degisken1 ve degisken2 sutünlarıdır.

In [88]:
#apply

In [7]:
df = pd.DataFrame({'gruplar':  ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [12]:
df.groupby("gruplar").apply(np.sum, axis = 0)

C:\Users\tcmur\AppData\Local\Temp\ipykernel_8704\1493713257.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby("gruplar").apply(np.sum, axis = 0)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [11]:
df.groupby("gruplar").apply(np.mean)

gruplar
A     98.5
B     99.5
C    358.5
dtype: float64

# Pivot Tablolar

In [21]:
# not : Pivot tablolar groupby'ın çok boyutlu versiyonudur.

In [30]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [14]:
# cinsiyete göre hayatta kalanların ortalamasını inceleyelim.

In [31]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [23]:
# groupby aracılığıyla pivot işlemi

In [32]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

C:\Users\tcmur\AppData\Local\Temp\ipykernel_8704\3680809584.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [27]:
# pivot ile table

In [33]:
titanic.pivot_table("survived", index = "sex", columns = "class", observed = False)

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [39]:
age = pd.cut(titanic["age"], [0, 18, 90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [44]:
titanic.pivot_table("survived", index = ["sex", age], columns = "class", observed = False)

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663